CaseUwithWallFunction/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include 	"ABLConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $T0;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform $T0;
    }
    outlet
    {
	type		inletOutlet;
	inletValue	uniform $T0;
	value		uniform $T0;
    }
    
    bottom
    {
        type            fixedValue;
        value           uniform $T0;
    }

    top
    {
        type            zeroGradient;
    }

    front
    {
        type 		cyclic;
	neighbourPatch 	back;
    }

    back
    {
        type 		cyclic;
	neighbourPatch 	front;
    }
}

// ************************************************************************* //
